text = {
    'main_info': '''

    ''',
    'events': '''

    ''',
    'holidays_and_pay': '''

    ''',
    'interactions': '''
--- Кураторская Поддержка ---
Спасибо Вам, что выбрали нашу школу и доверили своего ребенка на обучение. Мы будем прикладывать все усилия, чтобы дать максимальный результат и добиться поставленных Вами целей.
Что дальше?
Дальше у нас наступает первый месяц адаптации. Месяц, когда ученик знакомится ближе с педагогом, правилами группы, форматом обучения, своими обязанностями, и самое главное начинает сталкиваться с первыми трудностями.
-
Наша совместная задача, родителя и куратора держать руку на пульсе и сразу реагировать на все замечания и комментарии ребенка на любые моменты
образовательного процесса. Это позволит понимать ситуацию и вносить изменения в работу, что снизит стресс у ребенка и поможет быстрее влиться в процесс.
Пишите, пожалуйста, обратную связь и не бойтесь критиковать.
-
По всем вопросам обращайтесь, с удовольствием
ответим.
Мы здесь на связи с Вами с 9 до 20 по Москве в будни и с 10 до 19 в выходные дни. Куратор при необходимости будет Вам звонить, обсуждать процесс обучения.
    '''
}