text = {
    "holidays_and_pay": 'Переходим к разделу "Каникулы и оплата"...',
    "events": 'Переходим к разделу "Хакатон и Интенсив"...',
    "main_info": 'Переходим к разделу "Основная информация"...',
    "communication": 'Переходим к разделу "Связь и кураторская поддержка"...',
    "support": 'Переходим к разделу "Не нашли ответа на свой вопрос?"',
    "company_info": """
Какие задачи родителей мы решаем?

1. Мотивационные
2. Поиск хобби и расширение кругозора
3. Получение навыка
4. Создание крепкого фундамента
5. Введение в профессию

Студенты создают работы с 0, например:

1. Пишут личного помощника
2. Генератор паролей
3. Ежедневник
4. Пишем личного помощника
И многое другое

Если Вы не знаете какое направление выбрать, можно провести бесплатную консультацию. После консультации у вас будет объективное и твердое понимание что делать с ребенком в IT, куда идти и как развиваться

Миссия компании это сэкономить 9 лет жизни каждому ученику и заложить правильный фундамент, благодаря правильному выбору сферы развития и качественному образованию.

Наши преимущества:

1. Промышленный подход в программировании, вместо олимпиад
2. Педагогика превыше репетиторства и развлечений
3. Фундаментальное образование
4. Не только учиться, но и применять полученные навыки

Сколько это стоит?:

В группе: 2 урока по 60 минут. Скорость обучения: 1Х. Самостоятельная работа: 2 часа в неделю. 
От 8 000 р./мес

Наставничество: до 15 уроков по 60 минут. Скорость обучения: 2Х-4Х. Самостоятельная работа: 4-5 часов в неделю. 
От 10 000 р./мес
    """,
    "education": """
--- Обучение ---

Ребята учатся в группах по 4 человека. С ними работает учитель.
Программа состоит из частей, в каждой части есть задания. Задания разделены на шаги. В каждом шаге есть информация: статьи, ссылки, документы. Эту информацию нужно изучить, чтобы выполнить задание.
Когда задание выполнено, его проверяют. Проверяют настоящие программисты. Они пишут код. Если есть ошибки, нужно их исправить. Проверка занимает от 3 до 24 часов.
Пока одно задание проверяют, можно делать другое.
Педагог помогает, если есть вопросы. Он следит за работой, объясняет, если непонятно.
Материалы есть на платформе и дома. Домашнее задание — это несколько шагов, которые нужно сделать самостоятельно. От самостоятельной работы зависит, как быстро ты продвинешься в учёбе. Чем больше ты занимаешься программированием, тем быстрее проходишь программу.
На урок можно прийти с вопросами по заданиям.
    """,
    "discord": """
Чтобы зарегистрироваться в Discord нужно:
Шаг 1
Переходим по ссылке: https://discordapp.com/download
Затем нужно нажать кнопку "Вход" в открытом окне
Шаг 2
Затем нужно нажать "Зарегистрироваться"
Шаг 3
Для регистрации используйте гугл почту (gmail)
Не забудьте сохранить пароль куда-нибудь :)
При регистрации нужно будет указать год 2001 или более ранний, иначе
программа не сможет зарегистрировать аккаунт
После регистрации зайдите к себе на почту, чтобы подтвердить аккаунт.
Потом на сайте можно будет войти в дискорд, либо скачать его
Шаг 4
Как всё сделаете - напишите нам, пожалуйста, ваш никнейм, он будет
указан в левом нижнем углу
Если что-то непонятно будет - спрашивайте
""",
    "cur_support": """
--- Кураторская Поддержка ---
Спасибо Вам, что выбрали нашу школу и доверили своего ребенка на обучение. Мы будем прикладывать все усилия, чтобы дать максимальный результат и добиться поставленных Вами целей.
Что дальше?
Дальше у нас наступает первый месяц адаптации. Месяц, когда ученик знакомится ближе с педагогом, правилами группы, форматом обучения, своими обязанностями, и самое главное начинает сталкиваться с первыми трудностями.
-
Наша совместная задача, родителя и куратора держать руку на пульсе и сразу реагировать на все замечания и комментарии ребенка на любые моменты
образовательного процесса. Это позволит понимать ситуацию и вносить изменения в работу, что снизит стресс у ребенка и поможет быстрее влиться в процесс.
Пишите, пожалуйста, обратную связь и не бойтесь критиковать.
-
По всем вопросам обращайтесь, с удовольствием
ответим.
Мы на связи с Вами с 9 до 20 по Москве в будни и с 10 до 19 в выходные дни. Куратор при необходимости будет Вам звонить, обсуждать процесс обучения.
""",
    "pay": """
Вы оплачиваете каждый период/абонемент (8 занятий по утвержденному расписанию), каждые 28 дней, в последний день предыдущего оплаченного периода. Мы будем об этом напоминать. Если нет возможности оплатить в срок - предупредите, мы подождем, занятия при этом не приостанавливаем.
+Бонус
Когда по вашей рекомендации к нам придет новый ученик фиксированная скидка 2500 рублей на
один период.
""",
    "holidays": """
Новогодние, майские и летние каникулы - исключение, когда абонемент можно заморозить. В остальное время оплата идет каждые 8 занятий по расписанию.
Пропущенные основные занятия по любым причинам у вас не сгорают, а отрабатываются, вне расписания, по договоренности с педагогом, без привязки к оплате периодов. По запросу мы пришлем вам варианты, когда можно подключиться на отработку. Отработки проводятся в другой группе при наличии свободного места, либо индивидуально, но длительностью 45 минут. Если нет возможности отработать в учебное время, то копим пропуски и отрабатываем во время школьных каникул.
При решении сделать паузу в занятиях более трех недель без оплаты будущих уроков место в группе открепляется, и по возвращению если место занято - подбирается новая группа или педагог.
""",
    "intensive": """
Во время интенсива пишут 8 проектов на Python с нуля, чтобы получить первый опыт в IT или участвовать в хакатоне и выиграть призы.

Кому точно нужен интенсив?:

1. Ребятам от 12-13 лет, кто еще не знаком с Python, но хотел бы начать его изучать

2. Ребятам, кто уже сталкивался с Python, но проектов не делал

3. Ребятам 10-12 лет, кто уже уверенно програмирует на Python и занимается не менее полугода

4. Ребятам, кто хочет подготовиться к хакатону
    """,
    "hackathon": """
Задача хакатона отобрать 20 школьников для дальнейшего интенсивного обучения с выходом на стажировку в It-компанию
Для этого участникам нужно создать небольшую программу, связанную с обработкой фото, видео или аудио, это может быть консольная игра или чат-бот для telegram

Для кого:
Соревнования рассчитаны на школьников, знакомых с базовым синтаксисом по Python и написавших 2-3 программы. Если вы работали с циклами, словарями, дополнительными библиотеками и читаете документацию -это будет вашим преимуществом.
Для новичков с большим желанием мы проведем интенсив в преддверии хакатона.
    """,
}
