text = {
    'main_info': '''
    ''',
    'events': '''
    ''',
    'holidays_and_pay': '''
Новогодние, майские и летние каникулы - исключение, когда абонемент можно заморозить. В остальное время оплата идет каждые 8 занятий по расписанию.
Пропущенные основные занятия по любым причинам у вас не сгорают, а отрабатываются, вне расписания, по договоренности с педагогом, без привязки к оплате периодов. По запросу мы пришлем вам варианты, когда можно подключиться на отработку. Отработки проводятся в другой группе при наличии свободного места, либо индивидуально, но длительностью 45 минут. Если нет возможности отработать в учебное время, то копим пропуски и отрабатываем во время школьных каникул.
При решении сделать паузу в занятиях более трех недель без оплаты будущих уроков место в группе открепляется, и по возвращению если место занято - подбирается новая группа или педагог.

Вы оплачиваете каждый период/абонемент (8 занятий по утвержденному расписанию), каждые 28 дней, в последний день предыдущего оплаченного периода. Мы будем об этом напоминать. Если нет возможности оплатить в срок - предупредите, мы подождем, занятия при этом не приостанавливаем.
+Бонус
Когда по вашей рекомендации к нам придет новый ученик фиксированная скидка 2500 рублей на
один период.
    ''',
    'discord':'''
Чтобы зарегестрироваться в Discord нужно:
Шаг 1
Переходим по ссылке: https://discordapp.com/download
Затем нужно нажать кнопку "Вход" в открытом окне
Шаг 2
Затем нужно нажать "Зарегистрироваться"
Шаг 3
Для регистрации используйте гугл почту (gmail)
Не забудьте сохранить пароль куда-нибудь :)
При регистрации нужно будет указать год 2001 или более ранний, иначе
программа не сможет зарегистрировать аккаунт
После регистрации зайдите к себе на почту, чтобы подтвердить аккаунт.
Потом на сайте можно будет войти в дискорд, либо скачать его
Шаг 4
Как всё сделаете - напишите нам, пожалуйста, ваш никнейм, он будет
указан в левом нижнем углу
Если что-то непонятно будет - спрашивайте
'''
    'interactions': '''
--- Кураторская Поддержка ---
Спасибо Вам, что выбрали нашу школу и доверили своего ребенка на обучение. Мы будем прикладывать все усилия, чтобы дать максимальный результат и добиться поставленных Вами целей.
Что дальше?
Дальше у нас наступает первый месяц адаптации. Месяц, когда ученик знакомится ближе с педагогом, правилами группы, форматом обучения, своими обязанностями, и самое главное начинает сталкиваться с первыми трудностями.
-
Наша совместная задача, родителя и куратора держать руку на пульсе и сразу реагировать на все замечания и комментарии ребенка на любые моменты
образовательного процесса. Это позволит понимать ситуацию и вносить изменения в работу, что снизит стресс у ребенка и поможет быстрее влиться в процесс.
Пишите, пожалуйста, обратную связь и не бойтесь критиковать.
-
По всем вопросам обращайтесь, с удовольствием
ответим.
Мы здесь на связи с Вами с 9 до 20 по Москве в будни и с 10 до 19 в выходные дни. Куратор при необходимости будет Вам звонить, обсуждать процесс обучения.
    '''
}